Diagrams are converted to mermaid
